{
    "chapters": {
        "chapter1": {
            "title": "Portuguese Colonization",
            "mainimage": "images\/3.jpg",
            "storyimage": "images\/13.png",
            "content": [
                {
                    "heading": "The Portuguese Arrival in the East.",
                    "text": "The Portuguese were the first Europeans to come to the East, with the primary purpose of breaking the Islamic monopoly on the spice trade and spreading Christianity. In 1498, Vasco da Gama reached India, and the Portuguese succeeded in conquering Goa, making it the center of their operations in the East.",
                    "images": "images\/7247535.png"
                },
                {
                    "heading": "Portuguese Arrival in Melaka.",
                    "text": "The Portuguese had colonized Malacca from 1511-1641 for more than less than 130 years. Many traces of Portuguese heritage can be seen to this day, including the birth of the Serani Christian community in Melaka as a result of the marriage of the Portuguese with the local population. There are several words that come from the Portuguese language which are used in Malay such as wardrobe, towel, window and garpu. The dance and song of the Portuguese community in Melaka became a heritage national art. Some of the buildings left by the Portuguese like &amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;#039;A Farmosa&amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;#039; and &amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;#039;Church of St. Paul&amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;#039;.",
                    "images": "images\/WhatsApp Image 2023-05-31 at 17.57.54.jpeg"
                }
            ],
            "video": "https:\/\/youtube.com\/embed\/9x9ahU7m4tQ"
        },
        "chapter2": {
            "title": "Dutch Colonization",
            "mainimage": "images\/5.png",
            "storyimage": "images\/14.png",
            "content": [
                {
                    "images": "images\/Belanda_1.jpeg",
                    "heading": "20 March 1602",
                    "text": "Dutch merchants to join in forming the 'United East Indian Society' called the V.O.C. The main purpose of the VOC's establishment was to dominate the spice trade and monopolize the trade in lead ore.They also want to get rid of the Portuguese who are growing up in trade in the Malay region."
                },
                {
                    "images": "images\/Belanda_2.jpeg",
                    "heading": "1619",
                    "text": "Dutch had succeeded in taking control of Betawi on the island of Java. Betawi has become an alternative trading port for world traders other than Melaka.To ensure Portuguese domination in Southeast Asia disappeared completely, the Netherlands has launched several times Initially welcomed by Sultan Mahmud, the situation changed when Islamic merchants from India advised caution against the Portuguese, whom they considered enemies of Islam. This ultimately led to the arrest and detention of the Portuguese, providing them with a reason and an opportunity to attack Melaka, which they invaded in 1509 and 1511."
                },
                {
                    "images": "images\/Belanda_3.jpeg",
                    "heading": "1641-1650",
                    "text": "Attack on Melaka. Eventually they succeeded in defeating the Portuguese with the help of the Kingdom of Johor, the kingdom inherited from the Malay Sultanate of Melaka The Kingdom of Johor at that time was under the rule of Sultan Abdul Jalil, the replacement of Sultan Hammat Shah. The Netherlands is trying to expand its influence in trade in the country by crossing the border of Melaka."
                },
                {
                    "images": "images\/Belanda_4.jpeg",
                    "heading": "",
                    "text": "Dutch attempted to monopolize the trade of lead with silver by concluding a single treaty. Anyway, the locals are beginning to realize their attitude.The trade competition between Johor and the Netherlands since their friendship collapsed after the Portuguese fall in Malacca seemed to be like a “breach waiting side by side”."
                }
            ],
            "video": "https:\/\/www.youtube.com\/embed\/vA2ZPgJ-HtY"
        },
        "chapter3": {
            "title": "British Colonization",
            "mainimage": "images\/6.png",
            "storyimage": "images\/15.png",
            "content": [
                {
                    "images": "images\/British1.jpg",
                    "heading": "",
                    "text": ""
                },
                {
                    "images": "images\/British2.jpg",
                    "heading": "",
                    "text": ""
                },
                {
                    "images": "images\/British3.jpg",
                    "heading": "",
                    "text": ""
                },
                {
                    "images": "images\/British4.jpg",
                    "heading": "",
                    "text": ""
                },
                {
                    "images": "images\/British5.jpg",
                    "heading": "",
                    "text": ""
                }
            ],
            "video": "https:\/\/www.youtube.com\/embed\/nncOcrKpT8E"
        },
        "chapter4": {
            "title": "Japan Colonization",
            "mainimage": "images\/7.png",
            "storyimage": "images\/16.png",
            "content": [
                {
                    "images": "images\/Japan1.jpeg",
                    "heading": "Zaman Penjajahan Jepun ( 15 Feb 1942-15 Ogos 1945)",
                    "text": "Penjajahan Jepun merupakan salah satu peristiwa penting dalamsejarah negara kita. Walaupun Jepun menduduki negara kita selama 3 ½ tahun (15 Feb 1942-15 Ogos 1945), namun kesannya amat mendalam keatas penduduk Tanah Melayu.Seluruh Tanah Melayu dan Singapura ditawan dengan mengambilmasa 70 hari sahaja. Serangan dimulakan melalui dua arah iaitu melaluipantai timur dan pantai barat. Rancangan utama Jepun adalah untukmenubuhkan Pemerintahan Baru Asia Timur Raya di mana pihak Jepuntelah berjanji akan memberikan kemerdekaan kepada sesetengah negara di Asia Tenggara."
                },
                {
                    "images": "images\/Japan2.jpeg",
                    "heading": "Entry of Japanese troops from Siam",
                    "text": "The Japanese invasion of Malaya in December 1941, led by Lieutenant General Takaro Matsui's 5th Division, swiftly overcame British, Australian, and Indian defenses. Facing tactical advantages in air support, armored vehicles, and experience, the Japanese forces forced the Allies into retreat. The destruction of key bridges hindered British mobility, while Japanese divisions landed on both the east and west coasts. The sinking of Force Z by Japanese air power weakened naval defenses, allowing for further Japanese advancement along the west coast. The British delay in executing planned operations in southern Thailand and the loss of naval assets marked significant setbacks, paving the way for Japanese control over Malaya during World War II."
                }
            ],
            "video": "https:\/\/youtube.com\/embed\/DNmwhyyD5T8"
        },
        "chapter5": {
            "title": "Independence 1957",
            "mainimage": "images\/8.png",
            "storyimage": "images\/17.png",
            "content": [
                {
                    "images": "images\/Merdeka1.jpeg",
                    "heading": "",
                    "text": ""
                },
                {
                    "images": "images\/Merdeka2.jpeg",
                    "heading": "",
                    "text": ""
                },
                {
                    "images": "images\/Merdeka3.jpeg",
                    "heading": "",
                    "text": ""
                }
            ],
            "video": "https:\/\/youtube.com\/embed\/ZKRrCuxpb8k"
        },
        "chapter6": {
            "title": "Malaysia 1963",
            "mainimage": "images\/9.jpg",
            "storyimage": "images\/18.png",
            "content": [
                {
                    "images": "images\/1963_1.jpeg",
                    "heading": "",
                    "text": ""
                },
                {
                    "images": "images\/1963_2.jpeg",
                    "heading": "",
                    "text": ""
                },
                {
                    "images": "images\/1963_3.jpeg",
                    "heading": "",
                    "text": ""
                },
                {
                    "images": "images\/1963_4.jpeg",
                    "heading": "",
                    "text": ""
                },
                {
                    "images": "images\/1963_5.jpeg",
                    "heading": "",
                    "text": ""
                }
            ],
            "video": "https:\/\/youtube.com\/embed\/fKonrJIV3nw"
        }
    },
    "sections": [
        {
            "title": "Exploring Malaysia Heritage",
            "subtext": "What is history? It is the echo from the past to the future and the future's reflection of the past.",
            "content": [
                {
                    "text": "Malaysia, a Southeast Asian nation with a population of approximately 33 million people, is a diverse and culturally rich country with a complex history. It gained independence from British colonial rule in 1957 and named the country as 'Malaya' and expanded to include Sabah and Sarawak in 1963, forming the modern Malaysia we know today. Malaysia is divided into 13 states and three federal territories, each with its own unique character and cultural influences. The nation's history is marked by ancient kingdoms, European colonialism, and a commitment to preserving its ethnic and cultural diversity, making it a fascinating and harmonious blend of traditions and modernity."
                },
                {
                    "text": "Rich culinary heritage, and a harmonious coexistence of Malay, Chinese, Indian, and indigenous ethnic groups. With a mix of modern cities like Kuala Lumpur and historical gems like Georgetown in Penang, Malaysia offers a unique blend of old-world charm and modernity. Its cuisine is renowned for its diverse flavors, and its lush rainforests, pristine beaches, and picturesque highlands make it a haven for nature enthusiasts. Malaysia's multicultural society celebrates a variety of festivals and traditions, reflecting the nation's harmony and inclusiveness. Whether exploring its bustling urban centers or immersing oneself in its natural wonders, Malaysia offers an unforgettable and culturally rich experience."
                }
            ],
            "images": [
                "images\/10.jpg",
                "images\/11.jpg"
            ]
        }
    ],
    "aboutus": [
        {
            "images": [
                "images\/12.jpg"
            ]
        }
    ]
}